<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>GPL (adaptation française non officielle)</title>
</head>
<body>
<h1>GPL</h1>

<h2>Introduction</h2>
This is an unofficial translation of the GNU General Public License into
French.  It was not published by the Free Software Foundation, and does not
legally state the distribution terms for software that uses the GNU
GPL--only the original English text of the GNU GPL does that.  However, we
hope that this translation will help French speakers understand the GNU GPL
better.
<p>
Voici (http://www.linux-france.org/article/these/gpl.html) une adaptation non
officielle de la Licence Publique G&eacute;n&eacute;rale du projet GNU. Elle n'a pas &eacute;t&eacute;
publi&eacute;e par la Free Software Foundation et son contenu n'a aucune port&eacute;e
l&eacute;gale car seule la version anglaise de ce document d&eacute;taille le mode de
distribution des logiciels sous GNU GPL. Nous esp&eacute;rons cependant qu'elle
permettra aux francophones de mieux comprendre la GPL.

<h2>Licence Publique G&eacute;n&eacute;rale GNU Version&nbsp;2, Juin 1991</h2>

Copyright &copy; Free Software Foundation, Inc.<br>
59 Temple Place, Suite 330,
Boston, MA 02111-1307<br>
&eacute;tats-Unis, 1989, 1991.<br>
La copie et la distribution de copies exactes de ce document sont
autoris&eacute;es, mais aucune modification n'est permise.

<h2>Pr&eacute;ambule</h2>

Les licences d'utilisation de la plupart des programmes sont d&eacute;finies pour
limiter ou supprimer toute libert&eacute; &agrave; l'utilisateur. &agrave; l'inverse, la
Licence Publique G&eacute;n&eacute;rale (General Public License) est destin&eacute;e &agrave; vous
garantir la libert&eacute; de partager et de modifier les logiciels libres, et de
s'assurer que ces logiciels sont effectivement accessibles &agrave; tout
utilisateur.<p>

Cette Licence Publique G&eacute;n&eacute;rale s'applique &agrave; la plupart des programmes de
la Free Software Foundation, comme &agrave; tout autre programme dont l'auteur
l'aura d&eacute;cid&eacute; (d'autres logiciels de la FSF sont couverts pour leur part
par la Licence Publique G&eacute;n&eacute;rale pour Biblioth&egrave;ques GNU (LGPL)). Vous
pouvez aussi appliquer les termes de cette Licence &agrave; vos propres
programmes, si vous le d&eacute;sirez.<p>

<em>Libert&eacute;</em> des logiciels ne signifie pas n&eacute;cessairement
<em>gratuit&eacute;</em>. Notre Licence est conçue pour vous assurer la libert&eacute; de
distribuer des copies des programmes, gratuitement ou non, de recevoir le
code source ou de pouvoir l'obtenir, de modifier les programmes ou d'en
utiliser des &eacute;l&eacute;ments dans de nouveaux programmes libres, en sachant que
vous y êtes autoris&eacute;.<p>

Afin de garantir ces droits, nous avons d&ucirc; introduire des restrictions
interdisant &agrave; quiconque de vous les refuser ou de vous demander d'y
renoncer. Ces restrictions vous imposent en retour certaines obligations si
vous distribuez ou modifiez des copies de programmes prot&eacute;g&eacute;s par la
Licence. En d'autre termes, il vous incombera en ce cas de&nbsp;:

<ul>
  <li>transmettre aux destinataires tous les droits que vous
      poss&eacute;dez, 
  <li>exp&eacute;dier aux destinataires le code source ou bien tenir celui-ci &agrave;
      leur disposition,
  <li>leur remettre cette Licence afin qu'ils prennent connaissance de
      leurs droits.
</ul><p>

Nous prot&eacute;geons vos droits de deux façons&nbsp;: d'abord par le copyright
du logiciel, ensuite par la remise de cette Licence qui vous autorise
l&eacute;galement &agrave; copier, distribuer et/ou modifier le logiciel.<p>

En outre, pour prot&eacute;ger chaque auteur ainsi que la FSF, nous affirmons
solennellement que le programme concern&eacute; ne fait l'objet d'aucune garantie.
Si un tiers le modifie puis le redistribue, tous ceux qui en recevront une
copie doivent savoir qu'il ne s'agit pas de l'original afin qu'une copie
d&eacute;fectueuse n'entache pas la r&eacute;putation de l'auteur du logiciel.<p>

Enfin, tout programme libre est sans cesse menac&eacute; par des d&eacute;pôts de
brevets. Nous souhaitons &agrave; tout prix &eacute;viter que des distributeurs puissent
d&eacute;poser des brevets sur les Logiciels Libres pour leur propre compte. Pour
&eacute;viter cela, nous stipulons bien que tout d&eacute;pôt &eacute;ventuel de brevet doit
accorder express&eacute;ment &agrave; tout un chacun le libre usage du produit.<p>

Les dispositions pr&eacute;cises et les conditions de copie, de distribution et de
modification de nos logiciels sont les suivantes&nbsp;:

<h3>Stipulations et conditions relatives &agrave; la copie, la distribution et
la modification</h3>

<hr>
<ul>
  <li>Article 0<br>
      La pr&eacute;sente Licence s'applique &agrave; tout Programme (ou autre travail) où
      figure une note, plac&eacute;e par le d&eacute;tenteur des droits, stipulant que ledit
      Programme ou travail peut être distribu&eacute; selon les termes de la pr&eacute;sente
      Licence. Le terme <em>Programme</em> d&eacute;signe aussi bien le Programme
      lui-même que tout travail qui en est d&eacute;riv&eacute; selon la loi, c'est-&agrave;-dire
      tout ouvrage reproduisant le Programme ou une partie de celui-ci, &agrave;
      l'identique ou bien modifi&eacute;, et/ou traduit dans une autre langue (la
      traduction est consid&eacute;r&eacute;e comme une modification). Chaque personne
      concern&eacute;e par la Licence Publique G&eacute;n&eacute;rale sera d&eacute;sign&eacute;e par le terme
      <em>Vous</em>.<p>
      
      Les activit&eacute;s autres que copie, distribution et modification ne sont pas
      couvertes par la pr&eacute;sente Licence et sortent de son cadre. Rien ne
      restreint l'utilisation du Programme et les donn&eacute;es issues de celui-ci ne
      sont couvertes que si leur contenu constitue un travail bas&eacute; sur le
      logiciel (ind&eacute;pendemment du fait d'avoir &eacute;t&eacute; r&eacute;alis&eacute; en lançant le
      Programme). Tout d&eacute;pend de ce que le Programme est cens&eacute; produire.<br><br>
      <hr>
  <li>Article 1.<br>
      Vous pouvez copier et distribuer des copies conformes du code source du
      Programme, tel que Vous l'avez reçu, sur n'importe quel support, &agrave;
      condition de placer sur chaque copie un copyright appropri&eacute; et une
      restriction de garantie, de ne pas modifier ou omettre toutes les
      stipulations se r&eacute;f&eacute;rant &agrave; la pr&eacute;sente Licence et &agrave; la limitation de
      garantie, et de fournir avec toute copie du Programme un exemplaire de la
      Licence.<p>

      Vous pouvez demander une r&eacute;tribution financi&egrave;re pour la r&eacute;alisation de la
      copie et demeurez libre de proposer une garantie assur&eacute;e par vos soins,
      moyennant finances.<br><br>
      <hr>
  <li>Article 2.<br>
      Vous pouvez modifier votre copie ou vos copies du Programme ou partie de
      celui-ci, ou d'un travail bas&eacute; sur ce Programme, et copier et distribuer
      ces modifications selon les termes de l'article 1, &agrave; condition de Vous
      conformer &eacute;galement aux conditions suivantes&nbsp;:

      <ul>
        <li>a) Ajouter aux fichiers modifi&eacute;s l'indication tr&egrave;s claire des
            modifications effectu&eacute;es, ainsi que la date de chaque changement.
            
        <li>b) Distribuer sous les termes de la Licence Publique G&eacute;n&eacute;rale
            l'ensemble de toute r&eacute;alisation contenant tout ou partie du
            Programme, avec ou sans modifications.
        <li>c) Si le Programme modifi&eacute; lit des commandes de mani&egrave;re interactive
            lors de son ex&eacute;cution, faire en sorte qu'il affiche, lors d'une
            invocation ordinaire, le copyright appropri&eacute; en indiquant
            clairement la limitation de garantie (ou la garantie que Vous Vous
            engagez &agrave; fournir Vous-même), qu'il stipule que tout utilisateur
            peut librement redistribuer le Programme selon les conditions de la
            Licence Publique G&eacute;n&eacute;rale GNU, et qu'il montre &agrave; tout utilisateur
            comment lire une copie de celle-ci (exception&nbsp;: si le
            Programme original est interactif mais n'affiche pas un tel
            message en temps normal, tout travail d&eacute;riv&eacute; de ce Programme ne
            sera pas non plus contraint de l'afficher).
      </ul><p>
      Toutes ces conditions s'appliquent &agrave; l'ensemble des modifications. Si des
      &eacute;l&eacute;ments identifiables de ce travail ne sont pas d&eacute;riv&eacute;s du Programme
      et peuvent être raisonnablement consid&eacute;r&eacute;s comme ind&eacute;pendants, la
      pr&eacute;sente Licence ne s'applique pas &agrave; ces &eacute;l&eacute;ments lorsque Vous les
      distribuez seuls.
      Mais, si Vous distribuez ces mêmes &eacute;l&eacute;ments comme partie d'un ensemble
      coh&eacute;rent dont le reste est bas&eacute; sur un Programme soumis &agrave; la Licence, ils
      lui sont &eacute;galement soumis, et la Licence s'&eacute;tend ainsi &agrave; l'ensemble du
      produit, quel qu'en soit l'auteur.<p>

      Cet article n'a pas pour but de s'approprier ou de contester vos
      droits sur  un travail enti&egrave;rement r&eacute;alis&eacute; par Vous, mais plutôt
      d'ouvrir droit &agrave; un contrôle de la libre distribution de tout travail
      d&eacute;riv&eacute; ou collectif bas&eacute; sur le Programme.<p>

      En outre, toute fusion d'un autre travail, non bas&eacute; sur le Programme,
      avec le Programme (ou avec un travail d&eacute;riv&eacute; de ce dernier),
      effectu&eacute;e sur un support de stockage ou de distribution, ne fait pas
      tomber cet autre travail sous le contrôle de la Licence.<br><br>
      <hr>
  <li>Article 3.<br>
      Vous pouvez copier et distribuer le Programme (ou tout travail d&eacute;riv&eacute;
      selon les conditions &eacute;nonc&eacute;es dans l'article 1) sous forme de code
      objet ou ex&eacute;cutable, selon les termes des articles 0 et 1, &agrave;
      condition de respecter l'une des clauses suivantes&nbsp;:

      <ul>
        <li>a) Fournir le code source complet du Programme,
            sous une forme lisible par un ordinateur et selon les termes des
            articles 0 et 1, sur un support habituellement utilis&eacute; pour 
            l'&eacute;change de donn&eacute;es&nbsp;; ou,

        <li>b) Faire une offre &eacute;crite, valable pendant au moins trois ans,
            pr&eacute;voyant de donner &agrave; tout tiers qui en fera la demande une copie,
            sous forme lisible par un ordinateur, du code source correspondant,
            pour un tarif n'exc&eacute;dant pas le co&ucirc;t de la copie, selon
            les termes des articles 0 et 1, sur un support couramment utilis&eacute;
            pour l'&eacute;change de donn&eacute;es informatiques&nbsp;; ou,
            
        <li>c) Informer le destinataire de l'endroit où le code source peut
            être obtenu (cette solution n'est recevable que dans le cas d'une
            distribution non commerciale, et uniquement si Vous avez reçu le
            Programme sous forme de code objet ou ex&eacute;cutable avec l'offre
            pr&eacute;vue &agrave; l'alin&eacute;a <em>b</em> ci-dessus).
      </ul><p>

      Le code source d'un travail d&eacute;signe la forme de cet ouvrage sous laquelle
      les modifications sont les plus ais&eacute;es. Sont ainsi d&eacute;sign&eacute;s la totalit&eacute;
      du code source de tous les modules composant un Programme ex&eacute;cutable, de
      même que tout fichier de d&eacute;finition associ&eacute;, ainsi que les scripts
      utilis&eacute;s pour effectuer la compilation et l'installation du Programme
      ex&eacute;cutable. Toutefois, l'environnement standard de d&eacute;veloppement du
      syst&egrave;me d'exploitation mis en oeuvre (source ou binaire) -- compilateurs,
      biblioth&egrave;ques, noyau, etc. -- constitue une exception, sauf si ces
      &eacute;l&eacute;ments sont diffus&eacute;s en même temps que le Programme ex&eacute;cutable.<p>

      Si la distribution de l'ex&eacute;cutable ou du code objet consiste &agrave; offrir un
      acc&egrave;s permettant de copier le Programme depuis un endroit particulier,
      l'offre d'un acc&egrave;s &eacute;quivalent pour se procurer le code source au même
      endroit est consid&eacute;r&eacute; comme une distribution de ce code source, même si
      l'utilisateur choisit de ne pas profiter de cette offre.<br><br>
      <hr> 
  <li>Article 4.<br>
      Vous ne pouvez pas copier, modifier, c&eacute;der, d&eacute;poser ou distribuer le
      Programme d'une autre mani&egrave;re que l'autorise la Licence Publique G&eacute;n&eacute;rale.
      Toute tentative de ce type annule imm&eacute;diatement vos droits d'utilisation du
      Programme sous cette Licence. Toutefois, les tiers ayant reçu de Vous
      des copies du Programme ou le droit d'utiliser ces copies continueront &agrave;
      b&eacute;n&eacute;ficier de leur droit d'utilisation tant qu'ils respecteront pleinement
      les conditions de la Licence.<br><br>
      <hr> 
  <li>Article 5.<br>
      Ne l'ayant pas sign&eacute;e, Vous n'êtes pas oblig&eacute; d'accepter cette
      Licence. Cependant, rien d'autre ne Vous autorise &agrave; modifier ou distribuer
      le Programme ou quelque travaux d&eacute;riv&eacute;s&nbsp;: la loi l'interdit tant que Vous
      n'acceptez pas les termes de cette Licence. En cons&eacute;quence, en modifiant
      ou en distribuant le Programme (ou tout travail bas&eacute; sur lui), Vous
      acceptez implicitement tous les termes et conditions de cette Licence.<br><br>
      <hr>
  <li>Article 6.<br>
      La diffusion d'un Programme (ou de tout travail d&eacute;riv&eacute;) suppose l'envoi
      simultan&eacute; d'une licence autorisant la copie, la distribution ou la
      modification du Programme, aux termes et conditions de la Licence. Vous
      n'avez pas le droit d'imposer de restrictions suppl&eacute;mentaires aux droits
      transmis au destinataire. Vous n'êtes pas responsable du respect de la
      Licence par un tiers.<br><br>
      <hr>
  <li>Article 7.<br>
      Si, &agrave; la suite d'une d&eacute;cision de Justice, d'une plainte en contrefaçon ou
      pour toute autre raison (li&eacute;e ou non &agrave; la contrefaçon), des conditions Vous
      sont impos&eacute;es (que ce soit par ordonnance, accord amiable ou autre) qui se
      r&eacute;v&egrave;lent incompatibles avec les termes de la pr&eacute;sente Licence, Vous n'êtes
      pas pour autant d&eacute;gag&eacute; des obligations li&eacute;es &agrave; celle-ci&nbsp;: si Vous ne
      pouvez concilier vos obligations l&eacute;gales ou autres avec les conditions de
      cette Licence, Vous ne devez pas distribuer le Programme.<br><br>

      Si une partie quelconque de cet article est invalid&eacute;e ou inapplicable
      pour quelque raison que ce soit, le reste de l'article continue de
      s'appliquer et l'int&eacute;gralit&eacute; de l'article s'appliquera en toute autre
      circonstance.<br><br>

      Le pr&eacute;sent article n'a pas pour but de Vous pousser &agrave; enfreindre des
      droits ou des dispositions l&eacute;gales ni en contester la validit&eacute;&nbsp;;
      son seul objectif est de prot&eacute;ger l'int&eacute;grit&eacute; du syst&egrave;me de
      distribution du Logiciel Libre. De nombreuses personnes ont
      g&eacute;n&eacute;reusement contribu&eacute; &agrave; la large gamme de Programmes distribu&eacute;e
      de cette façon en toute confiance&nbsp;; il appartient &agrave; chaque
      auteur/donateur de d&eacute;cider de diffuser ses Programmes selon les crit&egrave;res
      de son choix.<br><br>
      <hr>
  <li>Article 8.<br>
      Si la distribution et/ou l'utilisation du Programme est limit&eacute;e dans
      certains pays par des brevets ou des droits sur des interfaces, le
      d&eacute;tenteur original des droits qui place le Programme sous la Licence
      Publique G&eacute;n&eacute;rale peut ajouter explicitement une clause de limitation
      g&eacute;ographique excluant ces pays. Dans ce cas, cette clause devient une
      partie int&eacute;grante de la Licence.<br><br>
      <hr>
  <li>Article 9.<br>
      La Free Software Foundation se r&eacute;serve le droit de publier p&eacute;riodiquement
      des mises &agrave; jour ou de nouvelles versions de la Licence. R&eacute;dig&eacute;es dans le
      même esprit que la pr&eacute;sente version, elles seront cependant susceptibles
      d'en modifier certains d&eacute;tails &agrave; mesure que de nouveaux probl&egrave;mes se font
      jour.<br><br>

      Chaque version poss&egrave;de un num&eacute;ro distinct. Si le Programme pr&eacute;cise un
      num&eacute;ro de version de cette Licence et « toute version ult&eacute;rieure », Vous
      avez le choix de suivre les termes et conditions de cette version ou de
      toute autre version plus r&eacute;cente publi&eacute;e par la Free Software Foundation.
      Si le Programme ne sp&eacute;cifie aucun num&eacute;ro de version, Vous pouvez alors
      choisir l'une quelconque des versions publi&eacute;es par la Free Software
      Foundation.<br><br>

      <hr>
  <li>Article 10.<br>
      Si Vous d&eacute;sirez incorporer des &eacute;l&eacute;ments du Programme dans d'autres
      Programmes libres dont les conditions de distribution diff&egrave;rent, Vous devez
      &eacute;crire &agrave; l'auteur pour lui en demander la permission. Pour ce qui est des
      Programmes directement d&eacute;pos&eacute;s par la Free Software Foundation,
      &eacute;crivez-nous&nbsp;: une exception est toujours envisageable. Notre d&eacute;cision
      sera bas&eacute;e sur notre volont&eacute; de pr&eacute;server la libert&eacute; de notre Programme ou
      de ses d&eacute;riv&eacute;s et celle de promouvoir le partage et la r&eacute;utilisation du
      logiciel en g&eacute;n&eacute;ral.<br><br>

      <center><strong>LIMITATION DE GARANTIE</strong></center>

      <hr>
  <li>Article 11.<br>

      Parce que l'utilisation de ce Programme est libre et gratuite, aucune
      garantie n'est fournie, comme le permet la loi. Sauf mention &eacute;crite, les
      d&eacute;tenteurs du copyright et/ou les tiers fournissent le Programme en l'&eacute;tat,
      sans aucune sorte de garantie explicite ou implicite, y compris les
      garanties de commercialisation ou d'adaptation dans un but
      particulier. Vous assumez tous les risques quant &agrave; la qualit&eacute; et aux effets
      du Programme. Si le Programme est d&eacute;fectueux, Vous assumez le co&ucirc;t de tous
      les services, corrections ou r&eacute;parations n&eacute;cessaires.<br><br>

      <hr>
  <li>Article 12.<br>
      Sauf lorsqu'explicitement pr&eacute;vu par la Loi ou accept&eacute; par &eacute;crit, ni le
      d&eacute;tenteur des droits, ni quiconque autoris&eacute; &agrave; modifier et/ou redistribuer
      le Programme comme il est permis ci-dessus ne pourra être tenu pour
      responsable de tout dommage direct, indirect, secondaire ou accessoire
      (pertes financi&egrave;res dues au manque &agrave; gagner, &agrave; l'interruption d'activit&eacute;s
      ou &agrave; la perte de donn&eacute;es, etc., d&eacute;coulant de l'utilisation du Programme ou
      de l'impossibilit&eacute; d'utiliser celui-ci).
</ul><br><br>
<hr>

<center><strong>FIN DES TERMES ET CONDITIONS</strong></center>

<h2>Comment appliquer ces directives &agrave; vos nouveaux programmes</h2>

Si vous d&eacute;veloppez un nouveau programme et d&eacute;sirez en faire b&eacute;n&eacute;ficier tout
un chacun, la meilleure m&eacute;thode est d'en faire un Logiciel Libre que tout
le monde pourra redistribuer et modifier selon les termes de la Licence
Publique G&eacute;n&eacute;rale.<br><br>

Pour cela, ins&eacute;rez les indications suivantes dans votre programme (il est
pr&eacute;f&eacute;rable et plus s&ucirc;r de les faire figurer au d&eacute;but de chaque fichier
source&nbsp;; dans tous les cas, chaque module source devra comporter au
minimum la ligne de « copyright » et indiquer où r&eacute;sident toutes les
autres indications)&nbsp;:

<hr>
<samp>
((une ligne pour donner le nom du programme et donner une id&eacute;e de
sa finalit&eacute;))<br>
Copyright &copy; 20xx ((nom de l'auteur))<br><br>

Ce programme est libre, vous pouvez le redistribuer et/ou le modifier
selon les termes de la Licence Publique G&eacute;n&eacute;rale GNU publi&eacute;e par la
Free Software Foundation (version 2 ou bien toute autre version
ult&eacute;rieure choisie par vous).<br><br>

Ce programme est distribu&eacute; car potentiellement utile, mais SANS AUCUNE
GARANTIE, ni explicite ni implicite, y compris les garanties de
commercialisation ou d'adaptation dans un but sp&eacute;cifique.
Reportez-vous &agrave; la Licence Publique G&eacute;n&eacute;rale GNU pour plus de d&eacute;tails.<br><br>

Vous devez avoir reçu une copie de la Licence Publique G&eacute;n&eacute;rale GNU
en même temps que ce programme&nbsp;; si ce n'est pas le cas, &eacute;crivez &agrave; la
Free Software Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA
02111-1307, &eacute;tats-Unis.
</samp>
<hr><br><br>

Ajoutez &eacute;galement votre adresse &eacute;lectronique, le cas &eacute;ch&eacute;ant, ainsi que
votre adresse postale.<br><br>

Si le programme est interactif, faites-lui afficher un court avertissement
du type de celui-ci &agrave; chaque invocation&nbsp;:

<hr>
...(nom du programme) version 69, Copyright &copy; 19aa nom de l'auteur<br><br>

...(nom du programme) est fourni sans AUCUNE GARANTIE.<br>
Pour plus de d&eacute;tails, tapez `g'.<br><br>

Ce programme est libre et vous êtes encourag&eacute; &agrave; le redistribuer
sous certaines conditions&nbsp;; tapez `c' pour plus de d&eacute;tails.
<hr><br><br>

Les commandes hypoth&eacute;tiques `g' et `c' doivent afficher les sections
appropri&eacute;es de la Licence Publique G&eacute;n&eacute;rale GNU. Bien entendu, vous pouvez
implanter ces commandes comme bon vous semble&nbsp;: options dans un menu,
ou bien accessibles d'un clic de souris, etc., tout d&eacute;pend de votre
programme.<br><br>

Si vous officiez en tant que programmeur, n'omettez pas de demander &agrave; votre
employeur, votre &eacute;tablissement scolaire ou autres de signer une d&eacute;charge
stipulant leur renoncement aux droits qu'ils pourraient avoir sur le
programme&nbsp;:

<hr><samp>
...((employeur, &eacute;cole...)) d&eacute;clare par la pr&eacute;sente ne pas revendiquer
de droits sur le programme « (nom du programme) » r&eacute;alis&eacute; par ...((nom de
l'auteur)).<br>

((signature du responsable)), ...((date)), 
...((nom et qualit&eacute; du responsable)).
</samp><br><br>

La Licence Publique G&eacute;n&eacute;rale ne permet pas d'inclure votre programme dans
des logiciels sous licence commerciale sp&eacute;cifique. Si votre programme est
une fonction de biblioth&egrave;que, vous jugerez probablement plus judicieux de
le faire relever de la Licence G&eacute;n&eacute;rale de Biblioth&egrave;que GNU (LGPL) plutôt
que de la pr&eacute;sente.
<hr>
<hr>
<!-- hhmts start -->
Last modified: Tue Sep 29 22:41:45 MET DST 1998
<!-- hhmts end -->
</body>
</html>
